# Worksheet 1

**Motive:**

This worksheet is meant to familiarize yourself with Jupyter Notebook, NumPy, and Pandas library. 

**Additional notes:**

Notebooks consist of a linear sequence of cells. There are three basic cell types:

- Code cells: Input and output of live code that is run in the kernel (Grey color). Code in this cell is executable and '#' is used to write the comment in the code cell. To see the output/run the code cell **Cmd/Ctrl+Enter**

- Markdown cells: Narrative text with embedded LaTeX equations (White color).

- Raw cells: Unformatted text that is included, without modification (White color).

For more information on Jupyter notebook, [Click here](https://www.edureka.co/blog/wp-content/uploads/2018/10/Jupyter_Notebook_CheatSheet_Edureka.pdf)

You should become familiar with reading the comments within the Code cells. This is usually where instructions and explanations are "hidden" on how to get the function to work. A comment in the code cell is preceded by a `\#` to ensure that the comment will not be read when the code is executed. To view the Python documentation for a function, use the `help` function. To run the below code cell, click your mouse anywhere on `print()` and use **Cmd/Ctrl+Enter** to run and view the function's documentation. When you double click the code cell, it would become editable and you can make changes and then run the cell using **Cmd/Ctrl+Enter**.

In [4]:
help(print)

Help on built-in function print in module builtins:

print(...)
    print(value, ..., sep=' ', end='\n', file=sys.stdout, flush=False)

    Prints the values to a stream, or to sys.stdout by default.
    Optional keyword arguments:
    file:  a file-like object (stream); defaults to the current sys.stdout.
    sep:   string inserted between values, default a space.
    end:   string appended after the last value, default a newline.
    flush: whether to forcibly flush the stream.

**Importing libraries**

We will be using various Python libraries to help the processing of data. By convention, we import all libraries at the very top of the notebook.

In [3]:
import pandas as pd
import numpy as np

**Keyboard shortcuts**

Following are the keyboard shortcuts to become proficient with Jupyter notebooks. To learn more about keyboard shortcuts, go to **Help --> Keyboard Shortcuts** in the menu above. 

1. `Ctrl` + `Return` : *Evaluate the current cell*
1. `Shift` + `Return`: *Evaluate the current cell and move to the next*
1. `ESC` : *command mode* (may need to press before using any of the commands below)
1. `a` : *create a cell above*
1. `b` : *create a cell below*
1. `dd` : *delete a cell*
1. `z` : *undo the last cell operation*
1. `m` : *convert a cell to markdown*
1. `y` : *convert a cell to code*

---
## Part 1: NumPy

Let's start the discussion from NumPy (Numerical computation tool). It is one of the most widely used python libraries and used for working with arrays. NumPy offers comprehensive mathematical functions, random number generators, linear algebra routines, Fourier transforms, and more. In the previous course, you have used Python lists that serve the purpose of arrays, but they are slow to process. NumPy aims to provide an array object that is up to 50x faster than traditional Python lists.

*NumPy gives you an enormous range of fast and efficient ways of creating arrays and manipulating numerical data inside them. While a Python list can contain different data types within a single list, all of the elements in a NumPy array should be homogenous. The mathematical operations that are meant to be performed on arrays would be extremely inefficient if the arrays weren’t homogenous.*

Let's start with the most important object in NumPy that is the ndarray.

In [8]:
array = np.array((1, 2, 3)) # creates a one-dimensional array. 
print(array)
type(array)

[1 2 3]

numpy.ndarray

In [9]:
my_list = [1,2,3]

array = np.array(my_list)

print(array)

[1 2 3]

To create arrays from range, we can use np.arange(START, STOP, STEP) function is like the python range function. The np. arange(...) function returns evenly spaced values within a given interval. For integer arguments, the method is equivalent to a Python inbuilt range function but returns the ndarray rather than a list.

In [10]:
np.arange(0, 10, 2)

array([0, 2, 4, 6, 8])

You can make a range of other types as well:

In [11]:
np.arange(np.datetime64('2016-12-31'), np.datetime64('2017-02-01'))

array(['2016-12-31', '2017-01-01', '2017-01-02', '2017-01-03',
       '2017-01-04', '2017-01-05', '2017-01-06', '2017-01-07',
       '2017-01-08', '2017-01-09', '2017-01-10', '2017-01-11',
       '2017-01-12', '2017-01-13', '2017-01-14', '2017-01-15',
       '2017-01-16', '2017-01-17', '2017-01-18', '2017-01-19',
       '2017-01-20', '2017-01-21', '2017-01-22', '2017-01-23',
       '2017-01-24', '2017-01-25', '2017-01-26', '2017-01-27',
       '2017-01-28', '2017-01-29', '2017-01-30', '2017-01-31'],
      dtype='datetime64[D]')

To create a two-dimensional array using NumPy, instead of passing the list now we have to pass a list of tuples or list of lists as given below.

In [21]:
two_dim_array = np.array([(1,2,3), (4,5,6), (7,8,9)])
print(two_dim_array)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

If the number of elements are not equal in the lists used to create a ndarray, then NumPy will create an array of a list, see the example below:

In [9]:
array = np.array([(1,2,3), (4,6), (7,8,9)])

print(array)

[(1, 2, 3) (4, 6) (7, 8, 9)]

/Volumes/dATA/anaconda/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  """Entry point for launching an IPython kernel.

<!-- BEGIN QUESTION -->

### Question 1

##### Create a vector with values ranging from 10 to 99 and name it "n_array"
<!--
BEGIN QUESTION
name: q1
manual: true
-->

In [20]:
# Write your code here
# BEGIN SOLUTION
n_array = 10 + np.arange(90) 
# OR
# n_array = np.arange(10,100)
print(n_array)
# END SOLUTION

[10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33
 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57
 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81
 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99]

<!-- END QUESTION -->



<!-- END QUESTION -->



### Properties of arrays

The properties of the array do not require (...) in the end, as these are the attributes of the array. 


1. Arrays have a shape attribute that corresponds to the number of rows, columns.

In [11]:
print(two_dim_array.shape)

(3, 3)

2. Arrays have a type that corresponds to the type of data they contain. There are 5 basic numerical data types are available viz. booleans (bool), integers (int), unsigned integers (uint) floating-point (float) and complex. The array(...) function along with an optional argument `dtype` allows defining the expected data type of the array elements.

In [12]:
y = np.int32([1,2,4])
y

array([1, 2, 4], dtype=int32)

In [13]:
x = np.float32([1.0, 2.0])
x

array([1., 2.], dtype=float32)

In [18]:
z = np.arange(start=0,stop=8,step=2, dtype=np.uint8)
z

array([0, 2, 4, 6], dtype=uint8)

To return the data type of NumPy array object, we can use `dtype` attribute of the array:

In [15]:
w=np.array([True, False, True, False])
w.dtype

dtype('bool')

In [16]:
two_dim_array.dtype

dtype('int64')

To convert the type of array to another data type, we can use the `.astype(DATA_TYPE)` method. For example:

In [17]:
z.astype(float)

array([0., 2., 4., 6.])

3. To check the dimension of an array, we can use the `ndim` attribute.

In [18]:
print(z.ndim)
print(two_dim_array.ndim)

1
2

4.  To inspect the number of elements in an array, we can use `size` attribute.

In [19]:
two_dim_array.size

9

5. To inspect the size in bytes of each element of the array, we can use the `itemsize` attribute. For example, an array of elements of type float64 has itemsize 8 (=64/8)

In [22]:
two_dim_array.itemsize

4

6. To inspect the memory size of an array (in byte), we can use `nbytes` attribute.

In [23]:
# array.nbytes = array.size * array.itemsize
two_dim_array.nbytes

36

To inspect general information of an array, we can use info(...) method.

In [22]:
print(np.info(two_dim_array))

class:  ndarray
shape:  (3, 3)
strides:  (24, 8)
itemsize:  8
aligned:  True
contiguous:  True
fortran:  False
data pointer: 0x7fe7f5fbbe50
byteorder:  little
byteswap:  False
type: int64
None

<!-- BEGIN QUESTION -->

<!-- BEGIN QUESTION -->

### Question 2
#####  Report the attributes (shape, dtype, size, itemsize, and nbytes) of NumPy array created in Question 1.
<!--
BEGIN QUESTION
name: q2
manual: true
-->

In [24]:
# Write your code here
# BEGIN SOLUTION
print("shape:", n_array.shape)
print("dtype:", n_array.dtype)
print("size:", n_array.size)
print("itemsize:", n_array.itemsize)
print("number of bytes of n_array:", n_array.nbytes)
# END SOLUTION

shape: (90,)
dtype: int32
size: 90
itemsize: 4
number of bytes of n_array: 360

<!-- END QUESTION -->



<!-- END QUESTION -->



### Reshape function
If we want to change the shape of an array after it is created, we can easily do it with `reshape(ROWS,COLUMNS)` function.

In [26]:
#creating a 2-d array
two_dim_array1 = np.array([(1,2,3,4), (5,6,7,8)])

two_dim_array1 = two_dim_array1.reshape(4,2)
print(two_dim_array1)

[[1 2]
 [3 4]
 [5 6]
 [7 8]]

*Note* - The new dimension must fit the number of elements in the original array. In the example above, the rows and columns can be interchangeable i.e. change rows and columns from (2,4) to (4,2) but cannot to (4,3). Because for (4,3) dimension, we need 12 elements, whereas we only have 8 elements. if try to reshape to this dimension, then Python will give an error as mentioned below:

<font color='blue'> ValueError: cannot reshape array of size 8 into shape (4,3) </font>

### Flatting Matrix

Flattening a matrix (higher dimensional array) produces a one-dimensional array.

In [28]:
one_dim=two_dim_array.flatten()

### Indexing and Slicing

**Indexing** 

Indexing is accessing an array element by referring to its index number. The indexes in NumPy arrays start with 0, meaning that the first element has index 0, and the second has index 1 etc. Numpy offers several ways to index into arrays.

**Slicing**

Slicing in python means taking elements from one given index to another given index. We can slice arrays similar to lists and pass slice instead of index like this: <font color='blue'>[start:end]</font>. We can also define the step, like this: <font color='blue'>[start:end:step]</font>. If we don't pass start it is considered 0. If we don't pass the end it is considered the length of the array in that dimension, and if we don't pass the step it is considered 1.

For example, one_dim[1] will index the second element of my array but if I want a range we can use one_dim[0:2] which will bring me the first two elements as an array. Similarly, for the last value of the array, we can use one_dim[-1].

In [29]:
one_dim[1] # returns the second element

one_dim[0:2] # returns first two elements

one_dim[-1] # returns the last element

9

For a two-dimensional array, to select an element by row and column indices:

In [30]:
print(two_dim_array[2][2])
# or more concisely
print(two_dim_array[2,2])

9
9

To index with slicing

In [31]:
print(two_dim_array[0:2, 0:2])

[[1 2]
 [4 5]]

As the NumPy array is a mutable object, we can use indexing to update the values of the items in the array, similar to Python lists.

In [29]:
two_dim_array[2, 2]=3
print(two_dim_array)

# Mutating with slicing
one_dim[0:3]=[4,4,5]
print(one_dim)

[[1 2 3]
 [4 5 6]
 [7 8 3]]
[4 4 5 4 5 6 7 8 9]

<!-- BEGIN QUESTION -->

<!-- BEGIN QUESTION -->

### Question 3
##### Write Python code below to create an 8x8 matrix and fill 0's and 1's to create a checkerboard pattern.

_Hint: You can use np.zeros((ROWS,COLUMNS),dtype=int) to create an array with all zeros and then change the required values._

<!--
BEGIN QUESTION
name: q3
manual: true
-->

In [30]:
# Write your code here
# BEGIN SOLUTION
Z = np.zeros((8,8),dtype=int)
Z[1::2,::2] = 1
Z[::2,1::2] = 1
print(Z)
# END SOLUTION

[[0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]
 [0 1 0 1 0 1 0 1]
 [1 0 1 0 1 0 1 0]]

<!-- END QUESTION -->



<!-- END QUESTION -->



**Boolean indexing**

If we want to choose which items in the array, the most natural way is to use boolean arrays that have the same shape as the original array.

In [33]:
# Current code cell and next code cell are used to elaborate the to return the values in the array greater than 5.
two_dim_array2 = np.arange(16).reshape(4,4)
temp=two_dim_array2>5 # This would generate a boolean array of size array above.
temp

array([[False, False, False, False],
       [False, False,  True,  True],
       [ True,  True,  True,  True],
       [ True,  True,  True,  True]])

In [34]:
two_dim_array2[temp]  # or arr[np.where(arr>5)] #The statement returns the flatten array of elements

array([ 6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

We can use logical operators:
- &: is representing LOGICAL AND; 
- |:  is representing LOGICAL OR; 
- not: is representing LOGICAL NOT
to combine the multiple conditions to create boolean array.

In [35]:
two_dim_array2[(two_dim_array2<4) | (two_dim_array2>6)]

array([ 0,  1,  2,  3,  7,  8,  9, 10, 11, 12, 13, 14, 15])

<!-- BEGIN QUESTION -->


### Question 4 
##### Reshape the n_array (created in Question 1) to (9,10) dimensions and name it as"n_array_reshaped". 
##### 1) Replace all the values in the "n_array_reshaped"  values greater than 90 to 1. 
##### 2) Swap the first row of the array with the last row of the array. 

<!--
BEGIN QUESTION
name: q4
manual: true
-->

In [39]:
# Write your code here
# BEGIN SOLUTION
n_array_reshaped=n_array.reshape(9,10)
n_array_reshaped[n_array_reshaped>90] =1
n_array_reshaped[[0,8]]=n_array_reshaped[[8,0]]
n_array_reshaped
# END SOLUTION

array([[90,  1,  1,  1,  1,  1,  1,  1,  1,  1],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]])

<!-- END QUESTION -->




## Arithmetic operations

We can apply arithmetic operations, such as adding two arrays using `+` operator as represented below:

![array addition in Java.png]()

In [35]:
print(two_dim_array + two_dim_array)

[[ 2  4  6]
 [ 8 10 12]
 [14 16  6]]

In [51]:
#Another way to do that
print(np.add(two_dim_array,two_dim_array))

[[ 2  4  6]
 [ 8 10 12]
 [14 16 18]]

Similarly, we can do subtraction, division and multiplication.

- np.subtract()

- np.divide()

- np.multiply()

In [50]:
#subtraction
print(np.subtract(two_dim_array,two_dim_array))

[[0 0 0]
 [0 0 0]
 [0 0 0]]

In [38]:
# multiplication
print(np.multiply(two_dim_array,two_dim_array))

[[ 1  4  9]
 [16 25 36]
 [49 64  9]]

In [39]:
# division
print(np.divide(two_dim_array,two_dim_array))

[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]

# Aggregating functions
Often when you are faced with a large amount of data, a first step is to compute summary statistics for the data in question. Perhaps the most common summary statistics are the mean and standard deviation, which allow you to summarize the “typical” values  in  a  dataset,  but  other  aggregates  are  useful  as  well  (the  sum,  product,  median, minimum and maximum, quantiles, etc.).

By default, each NumPy aggregation function will return the aggregate over the entire array:

In [49]:
one_dim.sum()

45

One  common  type  of  aggregation  operation  is  an  aggregate  along  a  row  or  column. Some data are stored in a two-dimensional array e.g. `two_dim_array`. Aggregation  functions  take  an  additional  argument specifying  the  axis  along  which the aggregate is computed. For example, to find the sum array (row-wise or column-wise), we can use sum(...) function by passing argument `axis= 0 or 1`,  axis = 1 will find sum row-wise and similarly for axis = 0 will find sum column-wise.

In [36]:
print(two_dim_array.sum(axis=0))

[12 15 18]

In [37]:
print(two_dim_array.sum(axis=1))

[ 6 15 24]

Similarly, we can find the minimum value within each
column by specifying axis=0

In [52]:
two_dim_array.min(axis=0)

array([1, 2, 3])

The  way  the  axis  is  specified  here  can  be  confusing  to  users  coming  from  other  languages.  The  axis  keyword  specifies  the  dimension  of  the  array  that  will  be  collapsed, rather than the dimension that will be returned. So specifying axis=0 means that the first axis will be collapsed: for two-dimensional arrays, this means that values within each column will be aggregated.

Some other important arithmetic functions available in NumPy are:
- np.mean: computes the mean
- np.std: standard deviation
- np.var variance
- and [many more](https://numpy.org/doc/stable/reference/ufuncs.html#math-operations)

There are times when you might want to carry out an operation between an array and a single number (also called an operation between a vector and a scalar) or between arrays of two different sizes. NumPy understands that multiplication should happen with each cell. That concept is called **broadcasting**. Broadcasting is a mechanism that allows NumPy to perform operations on arrays of different shapes.

In [42]:
print('original data', one_dim) 
print('after broadcasting', one_dim * 1.6)

original data [4 4 5 4 5 6 7 8 9]
after broadcasting [ 6.4  6.4  8.   6.4  8.   9.6 11.2 12.8 14.4]

<!-- BEGIN QUESTION -->


### Question 5 
#####  1) Find the mean, median, standard deviation of   "n_array_reshaped" array created in Question 4.

##### 2) Find the maximum and mean value using axis = 0 for appropriate aggregate functions. 

<!--
BEGIN QUESTION
name: q5
manual: true
-->

In [54]:
# Write your code here
# BEGIN SOLUTION
mean= np.mean(n_array_reshaped)
median= np.median(n_array_reshaped)
standard_deviation=np.std(n_array_reshaped)
print("Mean: {}, Median: {}, Standard Deviation: {:.2f}".format(mean, median, standard_deviation))

max_axis= np.max(n_array_reshaped, axis=0)
mean_axis = np.mean(n_array_reshaped, axis=0)
print(max_axis)
print(mean_axis)
# END SOLUTION

Mean: 45.1, Median: 45.5, Standard Deviation: 26.61
[90 81 82 83 84 85 86 87 88 89]
[50.         41.         41.88888889 42.77777778 43.66666667 44.55555556
 45.44444444 46.33333333 47.22222222 48.11111111]

<!-- END QUESTION -->



<!-- END QUESTION -->



### Joining multiple arrays

Joining means putting the contents of two or more arrays in a single array. We pass a sequence of arrays that we want to join to the concatenate(ARRAY_A, ARRAY_B) function, along with the `axis`. If `axis` is not explicitly passed, it is taken as 0. There is another method of joining via stack functions discussed below:

In [55]:
two_dim_array3= np.array([[11,22,41],[22,33,77],[44,55,66]])

print("Concatenation when axis = 1 is:\n",np.concatenate((two_dim_array, two_dim_array3), axis=1))

print("Vertical Stacking:\n",np.vstack((two_dim_array,two_dim_array3)))

print("Horizontal Stacking:\n",np.hstack((two_dim_array,two_dim_array3)))

Concatenation when axis = 1 is:
 [[ 1  2  3 11 22 41]
 [ 4  5  6 22 33 77]
 [ 7  8  9 44 55 66]]
Vertical Stacking:
 [[ 1  2  3]
 [ 4  5  6]
 [ 7  8  9]
 [11 22 41]
 [22 33 77]
 [44 55 66]]
Horizontal Stacking:
 [[ 1  2  3 11 22 41]
 [ 4  5  6 22 33 77]
 [ 7  8  9 44 55 66]]

### Splitting 
Splitting breaks one array into multiple.

We use array_split(ARRAY,NUMBER_OF_SPLITS, axis=1) function for splitting arrays along rows (axis=1), we pass the array and the number of splits. An alternate solution is using hsplit(...) function, which is the opposite of the hstack(...) function.

In [56]:
print("original Array:\n",two_dim_array2,"\n")
# Split an array into 2
print("Split by array_split() function: \n",np.array_split(two_dim_array2,2, axis=1),"\n")
print("Split by hspilt() function: \n",np.hsplit(two_dim_array2,2))

original Array:
 [[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]

Split by array_split() function:
 [array([[ 0,  1],
       [ 4,  5],
       [ 8,  9],
       [12, 13]]), array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15]])]

Split by hspilt() function:
 [array([[ 0,  1],
       [ 4,  5],
       [ 8,  9],
       [12, 13]]), array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15]])]

### Searching Arrays

You can search an array for a certain value, and return the indexes that get a match. To search an array, use the where(...) method of ndarray.

In [57]:
ind=np.where(one_dim==2)
ind

(array([1], dtype=int64),)

For example, to find the indexes where the values are odd

In [47]:
np.where(one_dim%2==1)

(array([2, 4, 6, 8]),)

<!-- BEGIN QUESTION -->


### Question 6 

##### 1) Create an array of  (9,10) dimensions using random values.  

_Hint: Use np.random.rand(ROWs, COLUMNS) function_

##### 2) Compute the Euclidean distance between two arrays n_array_reshaped (from Question 4) and array created in part 1 of this Question.

_Hint: np.linalg.norm(ARRAY_A-ARRAY_B), replace the capital words appropriately._

<!--
BEGIN QUESTION
name: q6
manual: true
-->

In [48]:
# Write your code here
# BEGIN SOLUTION
#Part 1)
new_array=np.random.rand(9,10) 
print(new_array)
#Part 2)
print(np.linalg.norm(n_array_reshaped-new_array))
# END SOLUTION

[[0.59822682 0.96329963 0.23089188 0.32708151 0.6524268  0.2964096
  0.96980425 0.38042634 0.58685425 0.38893521]
 [0.1627899  0.53237257 0.03038743 0.79397797 0.66975175 0.70810312
  0.3494887  0.20689259 0.74056208 0.92333877]
 [0.50277306 0.51298839 0.46870533 0.17732608 0.7555981  0.68788827
  0.66280333 0.35149777 0.60864722 0.15347137]
 [0.40919864 0.08195896 0.36458773 0.75731689 0.38192165 0.9625142
  0.03355816 0.14569225 0.75648092 0.16169466]
 [0.57236785 0.03244377 0.43971824 0.02637912 0.82548666 0.63175478
  0.15572941 0.79141779 0.46841443 0.70297081]
 [0.5258228  0.04033956 0.87414868 0.67346631 0.32603912 0.24036912
  0.56475714 0.10420975 0.39857024 0.22937632]
 [0.28835526 0.03207861 0.13552394 0.14229197 0.50086741 0.8491443
  0.23643101 0.17321525 0.17822207 0.21064879]
 [0.30517761 0.76976409 0.18709456 0.8093303  0.02310568 0.38483939
  0.69073455 0.08815372 0.41974666 0.88392848]
 [0.70699434 0.59486146 0.47880589 0.61225084 0.94433777 0.59031507
  0.24981045 0.60913897 0.84413381 0.48311964]]
493.3171860596849

<!-- END QUESTION -->



<!-- END QUESTION -->



### Sorting array

Sorting means putting elements in an ordered sequence. Ordered sequence is any sequence that has an order corresponding to elements, like numeric or alphabetical, ascending or descending. Although Python has built-in sort and sorted functions to work with lists, we won’t
discuss  them  here  because  NumPy’s  np.sort(...)  function  is  much  more efficient and useful for this purpose. This method returns a copy of the array, leaving the original array unchanged.

In [58]:
array = np.array(['banana', 'cherry', 'apple'])
print("\n The sorted array is: ", np.sort(array))

 The sorted array is:  ['apple' 'banana' 'cherry']

A related function is argsort(...), which instead returns the indices of the sorted elements:

In [59]:
np.argsort(array)

array([2, 0, 1], dtype=int64)

The  first  element  of  this  result  gives  the  index  of  the  smallest  element,  the  second value  gives  the  index  of  the  second  smallest,  and  so  on.  These  indices  can  then  be used (via fancy indexing) to construct the sorted array if desired

A  useful  feature  of  NumPy’s  sorting  algorithms  is  the  ability  to  sort  along  specific
rows or columns of a multidimensional array using the axis argument. For example:

In [60]:
# sort each column of two_dim_arrary data
np.sort(two_dim_array, axis=0)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [61]:
# sort each row of two_dim_arrary data
np.sort(two_dim_array, axis=1)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

The above discussion about NumPy is not exhaustive but would be good to start working with it. You may refer to the following for more information:

- **[NumPy Quick Start Tutorial](https://numpy.org/doc/stable/user/quickstart.html)**
- **[Stanford CS231n NumPy Tutorial](http://cs231n.github.io/python-numpy-tutorial/#numpy)**
- **[The Data 8 Textbook Chapter on NumPy](https://www.inferentialthinking.com/chapters/05/1/Arrays)**
- **[CheatSheet of Numpy](https://s3.amazonaws.com/assets.datacamp.com/blog_assets/Numpy_Python_Cheat_Sheet.pdf)**

## Part 2: Pandas

Pandas is one of the most widely used Python libraries in data science. It provides fast, flexible, and expressive data structures designed to work with “relational” or “labeled” data both easy and intuitive. We are going to start a `non-comprehensive` overview of the fundamental data structures in Pandas.  

In the remaining worksheet, we are going to discuss:

- Data Frames
- Indexes, Slicing, and Sorting
- Grouping and Pivoting
- Apply

_Note: Remember for working with Pandas, we need to load this library (already loaded at the top of this Worksheet)._

### Dataframes

A dataframe is a table in which each column has a type; there is an index over the columns (typically string labels) and an index over the rows (typically ordinal numbers. It is a 2-dimensional data structure that can store data of different types (including characters, integers, floating-point values, categorical data and more) in columns.

#### Manually Creating Dataframes

There are two syntax methods to create the dataframes.

**Syntax 1:** You can create a data frame by specifying the columns and values using a [dictionary](https://realpython.com/python-dicts/) as shown below. 

The keys of the dictionary are the column names, and the values of the dictionary are lists containing the row entries.

In [62]:
animals = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]})
animals

   Cows  Goats
0    12     22
1    20     19

**Syntax 2:** You can also define a dataframe by specifying the rows like below. 

Each row corresponds to a distinct tuple, and the columns are specified separately.

In [63]:
fruits = pd.DataFrame([(30, 21), (20,24), (34,12)], columns=['Apples', 'Banana'])
fruits

   Apples  Banana
0      30      21
1      20      24
2      34      12

In the above examples, when dataframe is printed, each row has a number starting from 0,1.... This label is called index of the rows. We can specifically mention it like column names.

In [64]:
fruit_sales = pd.DataFrame([(35,21), (20,24), (34,12)], columns=['Apples', 'Bananas'], index=["2017 Sales", "2018 Sales", "2019 Sales"])
fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      20       24
2019 Sales      34       12

Each column in a DataFrame is a Pandas Series, and is one dimensional. Many pandas operations return a DataFrame or a Series, Series do not have any name/header where as the dataframe has column names. Let's create a Pandas Series

In [65]:
quantities = ['4 cups', '1 cup', '2 large', '1 can']
items = ['Flour', 'Milk', 'Eggs', 'Spam']
ingredients = pd.Series(quantities, index=items)
print("Type of object is:\n", type(ingredients))
print("Series is: \n",ingredients)

Type of object is:
 <class 'pandas.core.series.Series'>
Series is:
 Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
dtype: object

<!-- BEGIN QUESTION -->


### Question 7

##### For a DataFrame `fruit_sales`, add a column using `fruit_sales['new column name'] = ...` and assign a list or array of values to the column. Add a column of integers containing 2017, 2018, and 2019 called `Year` to the `fruit_sales` table which adds the year of sales into the dataframe.

<!--
BEGIN QUESTION
name: q7
points: 1
manual: true
-->

In [54]:
# Write your code here
# BEGIN SOLUTION
fruit_sales["Year"] = [2017,2018,2019]
# END SOLUTION
fruit_sales

            Apples  Bananas  Year
2017 Sales      35       21  2017
2018 Sales      20       24  2018
2019 Sales      34       12  2019

<!-- END QUESTION -->

<!-- BEGIN QUESTION -->

### Question 8

##### Use the `.drop()` method to [drop](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop.html) the `Year` column you created. (Make sure to use the `axis` parameter correctly.) Note that `drop` does not change a table, but instead returns a new table with fewer columns or rows unless you set the optional `inplace` parameter.

*Hint*: Look through the documentation to see how you can drop multiple columns of a Pandas dataframe at once using a list of column names.

<!--
BEGIN QUESTION
name: q8
point: 1
manual: true
-->

In [55]:
# Write your code here
fruit_sales_original = fruit_sales.drop(["Year"], axis = 1) # SOLUTION
fruit_sales_original

            Apples  Bananas
2017 Sales      35       21
2018 Sales      20       24
2019 Sales      34       12

<!-- END QUESTION -->



<!-- END QUESTION -->



#### Importing Datasets as Dataframes
If you do a quick web search for 'importing datasets into Python' you'll see that there are numerous methods/commands for accomplishing this - read_excel, read_csv, read_table etc. 
The majority of these commands, however, require you to know a lot about the dataset already (are there variable names - headers - in the dataset? is the data separated by commas, semi-colons, etc. in the dataset?).  These commands will load the dataset as a "dataframe".

Pandas support the integration with many file formats or data sources out of the box (csv, excel, sql, json, parquet,…). Importing data from each of these data sources is provided by function with the prefix read_\*. Similarly, the to_\* methods are used to store data. We can import local files (on your computer) or remote files from the Web using these functions. Let's use read_csv(...) function to load the dataset from the following link ("https://raw.githubusercontent.com/sukhjitsehra/datasets/master/DATA200/Datasets/Beers.csv") and name the dataset as "beers". The dataset contains information on over 2000 craft beers from the United States.

In [66]:
URL="https://raw.githubusercontent.com/sukhjitsehra/datasets/master/DATA200/Datasets/Beers.csv"
beers= pd.read_csv(URL, index_col = False)
beers.head() # To look at first few rows of records of dataset

,Content,Type,ID,Flavour,BrewID,12,16,24,32,Other
0,22.000,IBU,1887,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
1,22.000,IBU,2505,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
2,0.049,AP,1887,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
3,0.049,AP,2505,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
4,40.000,IBU,502,Altbier,395,Alteration,NaN,NaN,NaN,NaN

You can obtain the dimensions of a dataframe by using the shape attribute `dataframe.shape`.

In [67]:
beers.shape

(4820, 10)

To look at the information of the dataframe by `dataframe.info()` method, i.e. Column names, Non-Null count, and Dtype (datatype of data in each column).

In [83]:
beers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4820 entries, 0 to 4819
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Content  3753 non-null   float64
 1   Type     4820 non-null   object
 2   ID       4820 non-null   int64
 3   Flavour  4810 non-null   object
 4   BrewID   4820 non-null   int64
 5   12       3052 non-null   object
 6   16       1682 non-null   object
 7   24       44 non-null     object
 8   32       10 non-null     object
 9   Other    34 non-null     object
dtypes: float64(1), int64(2), object(7)
memory usage: 376.7+ KB

To look at the basic statistics of numeric columns in the dataframe by `dataframe.describe()` method.

In [68]:
beers.describe()

           Content           ID       BrewID
count  3753.000000  4820.000000  4820.000000
mean     16.027804  1431.113278   231.749793
std      26.044056   752.381898   157.669242
min       0.001000     1.000000     0.000000
25%       0.054000   808.000000    93.000000
50%       0.070000  1453.500000   205.000000
75%      25.000000  2076.000000   366.000000
max     138.000000  2692.000000   557.000000

You can also convert the entire dataframe into a two-dimensional numpy array.

In [69]:
beers.values

array([[22.0, 'IBU', 1887, ..., nan, nan, nan],
       [22.0, 'IBU', 2505, ..., nan, nan, nan],
       [0.049, 'AP', 1887, ..., nan, nan, nan],
       ...,
       [nan, 'AP', 2210, ..., nan, nan, nan],
       [0.053, 'AP', 2527, ..., nan, nan, nan],
       [nan, 'AP', 1796, ..., nan, 'The CROWLER™', nan]], dtype=object)

### Select the subset of a dataframe

Pandas provide methods for slicing, selecting, and extracting the data you need from a dataframe.

- Select specific rows and/or columns using `loc` when using the row and column names.
- Select specific rows and/or columns using `iloc` when using the positions in the table.

#### Selection Using Label/Index (using loc)

**Column Selection** 

To select a column of a `DataFrame` by column label, the safest and fastest way is to use the `.loc` [method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html). General usage of `.loc` looks like `df.loc[rowname, colname]`. (Reminder that the colon `:` means "everything.")  For example, if we want the `color` column of the `ex` data frame, we would use: `ex.loc[:, 'color']`

- You can also slice across columns. For example, `beers.loc[:, 'Name':]` would select the column `Name` and all columns after `Name`.

- *Alternative:* While `.loc` is invaluable when writing production code, it may be a little too verbose for interactive use. One recommended alternative is the `[]` method, which takes on the form `df['colname']`.

**Row Selection**

Similarly, if we want to select a row by its label, we can use the same `.loc` method. In this case, the "label" of each row refers to the index (ie. primary key) of the dataframe.

In [70]:
#Example:
beers.loc[2:5, 'Flavour'] # Here, 2:5 are the row's index.

2    Abbey Single Ale
3    Abbey Single Ale
4             Altbier
5             Altbier
Name: Flavour, dtype: object

In [71]:
#Example:  Notice the difference between these two methods
#Just passing in 'Name' returns a Series while ['Name'] returns a Dataframe
beers.loc[2:5, ['Flavour']]

            Flavour
2  Abbey Single Ale
3  Abbey Single Ale
4           Altbier
5           Altbier

The `.loc` uses the Pandas row index rather than row id/position of rows in the dataframe to perform the selection. Also, notice that if you write `2:5` with `loc[]`, contrary to normal Python slicing functionality, the end index is included, so you get the row with index 5.

### Selection using Integer location (using iloc)

Another pandas feature is `iloc[]`, which lets you slice the dataframe by row position and column position instead of row index and column label (which is the case for `loc[]`). This is the main difference between the 2 functions and it is **important** that you remember the difference and why you might want to use one over the other. In addition, with `iloc[]`, the end index is NOT included, like with normal Python slicing.

As a mnemonic, remember that the `i` in `iloc` means "integer". 

Below, we have sorted the `beers` dataframe. Notice how the *position* of a row is not necessarily equal to the *index* of a row. For example, the first row is not necessarily the row associated with index 1. This distinction is important in understanding the difference between `loc[]` and `iloc[]`.

For this we would sort the data by 'ID', the sort_values() method is used to get data in the order. `sort_values(...)` defaults to ascending order, so if we want it to be descending order then an argument `ascending=False` can be passed to `sort_values(...)` function.

In [63]:
sorted_beers = beers.sort_values(by=['ID']) # For descending order beers.sort_values(by=['ID'],ascending=False)
sorted_beers.head()

,Content,Type,ID,Flavour,BrewID,12,16,24,32,Other
2171,0.065,AP,1,American Pale Ale (APA),166,Dale's Pale Ale,NaN,NaN,NaN,NaN
1926,65.000,IBU,1,American Pale Ale (APA),166,Dale's Pale Ale,NaN,NaN,NaN,NaN
838,85.000,IBU,4,American Double / Imperial IPA,166,Gordon Ale (2009),NaN,NaN,NaN,NaN
943,0.087,AP,4,American Double / Imperial IPA,166,Gordon Ale (2009),NaN,NaN,NaN,NaN
4568,35.000,IBU,5,Scottish Ale,166,Old Chub,NaN,NaN,NaN,NaN

Here is an example of how we would get the 12 rows with only the `ID` column of the  `sorted_beers` dataframe using both `iloc[]` and `loc[]`. Observe the difference, especially after sorting `beers` by ID.

In [64]:
sorted_beers.iloc[0:12, 2]

2171    1
1926    1
838     4
943     4
4568    5
4587    5
839     6
944     6
3388    7
3360    7
4369    8
4358    8
Name: ID, dtype: int64

Notice that using `loc[]` with 0:12 gives different results, since it selects using the *index*.

In [65]:
sorted_beers.loc[0:12,'ID'] # Rows with label/index between 0 to 12

0       1887
2       1887
1011    1888
906     1888
294     1889
        ...
4407    1918
4389    1918
4168    1919
4163    1919
12      1920
Name: ID, Length: 65, dtype: int64

Lastly, we can change the index of a dataframe using the `set_index` method.

In [66]:
#Example: We change the index from 0,1,2... to the Name column
df = beers[:5].set_index("ID") 
df

,Content,Type,Flavour,BrewID,12,16,24,32,Other
ID,,,,,,,,,
1887,22.000,IBU,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
2505,22.000,IBU,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
1887,0.049,AP,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
2505,0.049,AP,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
502,40.000,IBU,Altbier,395,Alteration,NaN,NaN,NaN,NaN

We can now lookup rows by name directly:

In [67]:
df.loc[[1887, 2505], :]

,Content,Type,Flavour,BrewID,12,16,24,32,Other
ID,,,,,,,,,
1887,22.000,IBU,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
1887,0.049,AP,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
2505,22.000,IBU,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
2505,0.049,AP,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN

However, if we still want to access rows by location we will need to use the integer loc (`iloc`) accessor:

In [68]:
df.iloc[1:4, 2:4]

               Flavour  BrewID
ID
2505  Abbey Single Ale      57
1887  Abbey Single Ale      57
2505  Abbey Single Ale      57

<!-- BEGIN QUESTION -->

### Question 9

##### Selecting multiple columns is easy.  You just need to supply a list of column names.  Select the `ID`, `BrewID` `Content`, `Type`, and `Flavour`  **in that order** from the `beers` dataframe and name it as `beers_selected`. _Note that `.loc[...]` can be used to re-order the columns within a dataframe._

<!--
BEGIN QUESTION
name: q9
points: 2
manual: true
-->

In [69]:
# Write your code here
beers_selected = beers.loc[:, ['ID', 'BrewID', 'Content', 'Type', 'Flavour']] # SOLUTION
beers_selected[:5]

     ID  BrewID  Content Type           Flavour
0  1887      57   22.000  IBU  Abbey Single Ale
1  2505      57   22.000  IBU  Abbey Single Ale
2  1887      57    0.049   AP  Abbey Single Ale
3  2505      57    0.049   AP  Abbey Single Ale
4   502     395   40.000  IBU           Altbier

<!-- END QUESTION -->



<!-- END QUESTION -->



### Filtering Data

#### Filtering with boolean arrays

Filtering is the process of removing unwanted material.  In your quest for cleaner data, you will undoubtedly filter your data at some point: whether it be for clearing up cases with missing values, for culling out fishy outliers, or for analyzing subgroups of your data set.  Note that compound expressions have to be grouped with parentheses. Example usage looks like `df[df['column name'] < 5]]`.

For your reference, some commonly used comparison operators are given below.

Symbol | Usage      | Meaning 
------ | ---------- | -------------------------------------
==     | a == b     | Does a equal b?
<=     | a <= b     | Is a less than or equal to b?
\>=     | a >= b     | Is a greater than or equal to b?
<      | a < b      | Is a less than b?
\>      | a > b      | Is a greater than b?
~      | ~p         | Returns negation of p
\|     | p \| q     | p OR q
&      | p & q      | p AND q
^      | p ^ q      | p XOR q (exclusive or)

In the following we construct the DataFrame containing only 'Flavour' == 'Abbey Single Ale' (filtering based on one condition)

In [70]:
beers[beers['Flavour'] == 'Abbey Single Ale']

,Content,Type,ID,Flavour,BrewID,12,16,24,32,Other
0,22.000,IBU,1887,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
1,22.000,IBU,2505,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
2,0.049,AP,1887,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
3,0.049,AP,2505,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN

More than one condition can be used to filter the data. We can combine multiple conditions using various conditional operators.

In [71]:
beers.loc[(beers.Flavour.isin(['Abbey Single Ale', 'Altbier'])) & (beers.Content>= 20)]

,Content,Type,ID,Flavour,BrewID,12,16,24,32,Other
0,22.0,IBU,1887,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN
1,22.0,IBU,2505,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN
4,40.0,IBU,502,Altbier,395,Alteration,NaN,NaN,NaN,NaN
5,30.0,IBU,573,Altbier,268,Long Trail Ale (1),NaN,NaN,NaN,NaN
8,33.0,IBU,1090,Altbier,268,NaN,Double Bag,NaN,NaN,NaN
10,40.0,IBU,1248,Altbier,122,Main St. Virginia Ale,NaN,NaN,NaN,NaN
13,43.0,IBU,2339,Altbier,144,Little Red Cap,NaN,NaN,NaN,NaN
15,40.0,IBU,2377,Altbier,122,Main St. Virginia Ale,NaN,NaN,NaN,NaN
16,29.0,IBU,2605,Altbier,25,NaN,Tip Off,NaN,NaN,NaN

### Create new columns derived from existing columns

To create a new column by assigning the output to the DataFrame with a new column name in between the `[...]`.

In [72]:
df["New_content"]=df["Content"]+2
df

,Content,Type,Flavour,BrewID,12,16,24,32,Other,New_content
ID,,,,,,,,,,
1887,22.000,IBU,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN,24.000
2505,22.000,IBU,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN,24.000
1887,0.049,AP,Abbey Single Ale,57,Abbey's Single Ale (Current),NaN,NaN,NaN,NaN,2.049
2505,0.049,AP,Abbey Single Ale,57,Abbey's Single (2015- ),NaN,NaN,NaN,NaN,2.049
502,40.000,IBU,Altbier,395,Alteration,NaN,NaN,NaN,NaN,42.000

_Note: The calculation of the values is done element_wise. This means all values in the given column are added by the value 2 at once. You do not need to use a loop to iterate each of the rows!_

<!-- BEGIN QUESTION -->

### Question 10

##### 1) Filter the beers dataset include beers of type "IBU" and beer content is greater than 20, and name the dataset "beers_IBU'. 
##### 2) Sort the data by `BrewID` in descending order and use the DATAFRAME.to_csv("NEW_FILE_NAME") command to save it to your DATA200 folder (substituting appropriately for the CAPITAL letters).
<!--
BEGIN QUESTION
name: q10
points: 2
manual: true
-->

In [73]:
# Write your code here
# BEGIN SOLUTION
beers_IBU = beers.loc[(beers.Type== "IBU") & (beers.Content> 20)]
beers_IBU= beers_IBU.sort_values(by="BrewID", ascending=False)
beers_IBU.to_csv("beers_IBU.csv")
# END SOLUTION
beers_IBU

,Content,Type,ID,Flavour,BrewID,12,16,24,32,Other
695,22.0,IBU,382,American Brown Ale,546,NaN,Common Sense Kentucky Common Ale,NaN,NaN,NaN
1111,70.0,IBU,381,American IPA,546,Upstate I.P.W.,NaN,NaN,NaN,NaN
4160,30.0,IBU,392,Maibock / Helles Bock,545,Rumspringa Golden Bock,NaN,NaN,NaN,NaN
3986,28.0,IBU,195,Kölsch,545,Lancaster German Style Kölsch,NaN,NaN,NaN,NaN
1956,55.0,IBU,413,American Pale Ale (APA),541,Sky High Rye,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
2805,25.0,IBU,2688,American Porter,0,NaN,Stronghold,NaN,NaN,NaN
1499,50.0,IBU,2692,American IPA,0,NaN,Get Together,NaN,NaN,NaN
4312,38.0,IBU,2689,Pumpkin Ale,0,NaN,Pumpion,NaN,NaN,NaN
3621,47.0,IBU,2687,Extra Special / Strong Bitter (ESB),0,NaN,Parapet ESB,NaN,NaN,NaN
4189,26.0,IBU,2691,Milk / Sweet Stout,0,NaN,Maggie's Leap,NaN,NaN,NaN

<!-- END QUESTION -->



<!-- END QUESTION -->



### Grouping

Sometimes, we want to calculate a given statistic (e.g. mean) for each category in a column (e.g. male/female in the Sex column). The `.groupby(...)` method is used to support this type of operation.

The general process of `groupby(...)` involves the following steps:

*  Split: Splitting the data into groups based on some criteria.
*  Apply: Applying a function to each group independently:
   - .sum()
   - .count()
   - .mean() 
   - .std() 
   - .aggregate()
   - .apply() etc..
* Combine: Combining the results into a data structure.

<img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/DV0101EN/labs/Images/Mod3Fig4SplitApplyCombine.png" height=400 align="center">

Let's look at the unique values of `Type` from `beers` dataset.

In [72]:
beers.Type.unique()

array(['IBU', 'AP'], dtype=object)

Let's try to find the mean Content in each type of beer.

In [73]:
beers.groupby('Type').Content.mean()# OR beers.groupby('Type')["Content"].mean()

Type
AP      0.059773
IBU    42.713167
Name: Content, dtype: float64

Here, `groupby(...)` created group based on `Type` column. Then, for each of `Type`, we grabbed the `Content` column and find the mean content. We can also apply groupby(...) method based on multiple columns. For example, given below:

In [74]:
temp_df=beers.groupby(['Type', 'Flavour']).Content.max()# OR beers.groupby(['Type', 'Flavour'])["Content"].max()
temp_df

Type  Flavour
AP    Abbey Single Ale               0.049
      Altbier                        0.072
      American Adjunct Lager         0.055
      American Amber / Red Ale       0.082
      American Amber / Red Lager     0.057
                                     ...
IBU   Tripel                        34.000
      Vienna Lager                  33.000
      Wheat Ale                     24.000
      Winter Warmer                 45.000
      Witbier                       27.000
Name: Content, Length: 198, dtype: float64

The opposite to `.groupby(...)` method is .reset_index(...).

In [75]:
temp_df.reset_index()

    Type                     Flavour  Content
0     AP            Abbey Single Ale    0.049
1     AP                     Altbier    0.072
2     AP      American Adjunct Lager    0.055
3     AP    American Amber / Red Ale    0.082
4     AP  American Amber / Red Lager    0.057
..   ...                         ...      ...
193  IBU                      Tripel   34.000
194  IBU                Vienna Lager   33.000
195  IBU                   Wheat Ale   24.000
196  IBU               Winter Warmer   45.000
197  IBU                     Witbier   27.000

[198 rows x 3 columns]

A apply(FUNCTION) method allows the users to pass a function and apply it on every single value of the Pandas series. This function acts as a Python map(...) function.

In [76]:
temp_df.reset_index().Flavour.apply(len)

0      16
1       7
2      22
3      24
4      26
       ..
193     6
194    12
195     9
196    13
197     7
Name: Flavour, Length: 198, dtype: int64

To count number of records by category, we can use `value_counts(...)` method is just a shortcut to this `groupby()` operation.

In [77]:
beers['Flavour'].value_counts()

American IPA                      848
American Pale Ale (APA)           490
American Amber / Red Ale          266
American Blonde Ale               216
American Double / Imperial IPA    210
                                 ...
Smoked Beer                         2
Braggot                             2
Flanders Oud Bruin                  2
American Malt Liquor                2
Flanders Red Ale                    2
Name: Flavour, Length: 99, dtype: int64

### Reshaping

To make the analysis of data easier, we can reshape the data into a more computer-friendly form using Pandas in Python. Two most widely used methods are given below for converting:

- Long to wide table format by `pivot(...)` function. Reshape data (produce a “pivot” table) based on column values. Uses unique values from specified index / columns to form axes of the resulting Dataframe.
- Wide to long format by `melt(...)` function. The column headers become the variable names in a newly created column.

Take a look at the beers dataset.  Notice that the last five columns represent the volume (or size) of each beer in fluid ounces and the entry in each cell is the beer's name.  Therefore, 

    i. Create a dataset named beers2 that replaces the last 5  columns in the beers dataset with 2 columns called "Volume" and "Name" using the melt(...) method.
    ii. Use the arrange(...) command to view the new dataset by "ID".

In [80]:
beers2=beers.melt(id_vars=["Content","Type","ID", "Flavour", "BrewID"], value_vars =["12","16","24","32","Other"],
           var_name="Volume", value_name="Name")
beers2.sort_values(by=("ID")).head(20)

,Content,Type,ID,Flavour,BrewID,Volume,Name
6991,0.065,AP,1,American Pale Ale (APA),166,16,NaN
16631,0.065,AP,1,American Pale Ale (APA),166,32,NaN
2171,0.065,AP,1,American Pale Ale (APA),166,12,Dale's Pale Ale
11811,0.065,AP,1,American Pale Ale (APA),166,24,NaN
6746,65.000,IBU,1,American Pale Ale (APA),166,16,NaN
21206,65.000,IBU,1,American Pale Ale (APA),166,Other,NaN
16386,65.000,IBU,1,American Pale Ale (APA),166,32,NaN
1926,65.000,IBU,1,American Pale Ale (APA),166,12,Dale's Pale Ale
21451,0.065,AP,1,American Pale Ale (APA),166,Other,NaN
11566,65.000,IBU,1,American Pale Ale (APA),166,24,NaN
5763,0.087,AP,4,American Double / Imperial IPA,166,16,NaN
838,85.000,IBU,4,American Double / Imperial IPA,166,12,Gordon Ale (2009)
20223,0.087,AP,4,American Double / Imperial IPA,166,Other,NaN
10583,0.087,AP,4,American Double / Imperial IPA,166,24,NaN
15403,0.087,AP,4,American Double / Imperial IPA,166,32,NaN
5658,85.000,IBU,4,American Double / Imperial IPA,166,16,NaN
943,0.087,AP,4,American Double / Imperial IPA,166,12,Gordon Ale (2009)
20118,85.000,IBU,4,American Double / Imperial IPA,166,Other,NaN
15298,85.000,IBU,4,American Double / Imperial IPA,166,32,NaN
10478,85.000,IBU,4,American Double / Imperial IPA,166,24,NaN

Note, however, that the original data only listed each beer ID two times (i.e. once for its Bitterness or IBU and once for its alcohol percentage or AP) but the new dataset lists each beer ID ten times.  This occurs since, for example, ID 1 now has 8 "NAs" for Names along with two 12 ounce values (technically, the beer could have been brewed in all 5 sizes but it wasn't).

<!-- BEGIN QUESTION -->

<!-- BEGIN QUESTION -->

### Question 11
 
##### 1) Redefine beers2 dataset as beers3 so that it excludes the "NA"s in the "Name" variable (hint: use DATAFRAME.dropna(subset=['COLUMN1', 'COLUMN2']) to drop values those are NAs in the selected columns) and use sort_values(...)  command to sort beers3 by "ID" .

_Note: Each beer ID should now only appear twice as it did in the original dataset._

##### 2) As has been mentioned, notice that the beers3 dataset still has 2 rows for each beer ID (or Name of beer).   Define beers4 using the pivot(columns="Type", values="Content") command to convert the "Type" variable into 2 separate variables - one called IBU (the international bitterness unit) and one called AP (the alcohol percentage as a decimal) - by "Content" as value.

<!--
BEGIN QUESTION
name: q11
points: 2
manual: true
-->

In [81]:
# Write your code here
# BEGIN SOLUTION
# 1)
beers3=beers2.dropna(subset=["Name"])
beers3.sort_values(by="ID")
print(beers3)
# 2)
beers4= beers3.pivot(columns="Type", values="Content")
print(beers4)
# END SOLUTION

       Content Type    ID           Flavour  BrewID Volume  \
0       22.000  IBU  1887  Abbey Single Ale      57     12
1       22.000  IBU  2505  Abbey Single Ale      57     12
2        0.049   AP  1887  Abbey Single Ale      57     12
3        0.049   AP  2505  Abbey Single Ale      57     12
4       40.000  IBU   502           Altbier     395     12
...        ...  ...   ...               ...     ...    ...
23623    0.128   AP  2565  Quadrupel (Quad)      51  Other
23676      NaN  IBU  2564          Rye Beer      51  Other
23694    0.104   AP  2564          Rye Beer      51  Other
23903   34.000  IBU  2575            Tripel      45  Other
23914    0.085   AP  2575            Tripel      45  Other

                                                    Name
0                           Abbey's Single Ale (Current)
1                                Abbey's Single (2015- )
2                           Abbey's Single Ale (Current)
3                                Abbey's Single (2015- )
4                                             Alteration
...                                                  ...
23623  Lee Hill Series Vol. 5 - Belgian Style Quadrup...
23676   Lee Hill Series Vol. 4 - Manhattan Style Rye Ale
23694   Lee Hill Series Vol. 4 - Manhattan Style Rye Ale
23903                                     Wooden Rooster
23914                                     Wooden Rooster

[4822 rows x 7 columns]
Type      AP   IBU
0        NaN  22.0
1        NaN  22.0
2      0.049   NaN
3      0.049   NaN
4        NaN  40.0
...      ...   ...
23623  0.128   NaN
23676    NaN   NaN
23694  0.104   NaN
23903    NaN  34.0
23914  0.085   NaN

[4822 rows x 2 columns]